In [1]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine, text
import getpass  # To get the password without showing the input
password = getpass.getpass()

 ········

In [2]:
# 1. Establish a connection between Python and the Sakila database.

bd = "sakila"
connection_string = 'mysql+pymysql://root:' + password + '@localhost/'+bd
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [3]:
# 2.

def rentals_month(engine, month, year):
    with engine.connect() as connection:
        query = text(
            f"""
            SELECT *
            FROM rental
            WHERE
                DATE_FORMAT(CONVERT(rental_date, DATE), '%Y') = :year
                AND DATE_FORMAT(CONVERT(rental_date, DATE), '%M') = :month;
            """
        )
        result = connection.execute(query, {'year': year, 'month': month})
        df = pd.DataFrame(result.fetchall())
        df.columns = result.keys()
    return df

In [4]:
year = 2005
month = "August"
df = rentals_month(engine, month, year)
df.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,10181,2005-08-01 00:00:44,3111,113,2005-08-04 19:33:44,1,2006-02-15 21:30:53
1,10182,2005-08-01 00:08:01,4112,578,2005-08-09 18:14:01,2,2006-02-15 21:30:53
2,10183,2005-08-01 00:08:01,4319,377,2005-08-09 20:41:01,1,2006-02-15 21:30:53
3,10184,2005-08-01 00:09:33,2785,77,2005-08-05 04:12:33,2,2006-02-15 21:30:53
4,10185,2005-08-01 00:12:11,1266,64,2005-08-03 03:03:11,1,2006-02-15 21:30:53

In [5]:
# 3.

def rental_count_month(df, month, year):
    df = df[['customer_id', 'rental_date']]
    df = df.rename(columns={'rental_date': f'rentals_{month}_{year}'})
    grouped = df.groupby(df.customer_id).count()
    return grouped

In [6]:
# 4.

def compare_rentals(df1, df2):
    joined = df1.join(df2, on='customer_id')
    joined['difference'] = joined[joined.columns[1]] - joined[joined.columns[0]]
    return joined

In [7]:
df1 = rentals_month(engine, "May", 2005)
df1 = rental_count_month(df1, "May", 2005)
df1

             rentals_May_2005
customer_id
1                           2
2                           1
3                           2
5                           3
6                           3
...                       ...
594                         4
595                         1
596                         6
597                         2
599                         1

[520 rows x 1 columns]

In [8]:
df2 = rentals_month(engine, "August", 2005)
df2 = rental_count_month(df2, "August", 2005)
df2

             rentals_August_2005
customer_id
1                             11
2                             11
3                              7
4                             11
5                             13
...                          ...
595                            8
596                           13
597                           12
598                            5
599                            7

[599 rows x 1 columns]

In [9]:
comparison = compare_rentals(df1, df2)
comparison

             rentals_May_2005  rentals_August_2005  difference
customer_id
1                           2                   11           9
2                           1                   11          10
3                           2                    7           5
5                           3                   13          10
6                           3                   12           9
...                       ...                  ...         ...
594                         4                    3          -1
595                         1                    8           7
596                         6                   13           7
597                         2                   12          10
599                         1                    7           6

[520 rows x 3 columns]